weight = float(input("กรุณาใส่น้ำหนักของคุณ (กิโลกรัม): "))
height = float(input("กรุณาใส่ความสูงของคุณ (เมตร): "))

bmi = weight / (height ** 2)

print("ดัชนีมวลกาย (BMI) ของคุณคือ: %.2f" %bmi)

if bmi < 18.5:
    print("อยู่ในเกณฑ์: นํ้าหนักน้อย / ผอม")
    print("ภาวะเสี่ยงต่อโรค: มากกว่าคนปกติ")
elif bmi < 22.9:
    print("อยู่ในเกณฑ์: ปกติ (สุขภาพดี)")
    print("ภาวะเสี่ยงต่อโรค: เท่าคนปกติ")
elif bmi < 24.9:
    print("อยู่ในเกณฑ์: ท้วม / โรคอ้วนระดับ 1")
    print("ภาวะเสี่ยงต่อโรค: อันตรายระดับ 1")
elif bmi < 29.9:
    print("อยู่ในเกณฑ์: อ้วน / โรคอ้วนระดับ 2")
    print("ภาวะเสี่ยงต่อโรค: อันตรายระดับ 2")
else:
    print("อยู่ในเกณฑ์: อ้วนมาก / โรคอ้วนระดับ 3")
    print("ภาวะเสี่ยงต่อโรค: อันตรายระดับ 3")
